In [1]:
#import pandas
import pandas as pd

In [2]:
# you can create a series by passing a list
# when you do that, pandas assign an index starting with zero

students = ['Alice', 'Jack', 'Molly']
pd.Series(students) #The pandas automatically identifies the data type

0    Alice
1     Jack
2    Molly
dtype: object

In [3]:
# creating a list of numbers
numbers = [ 1 , 2 , 3]
pd.Series(numbers) #here the list was created as int64

0    1
1    2
2    3
dtype: int64

In [4]:
# if we create None in list of number
list= [1 , 2 , None]
pd.Series(list)

0    1.0
1    2.0
2    NaN
dtype: float64

In [5]:
# NaN is not even equal to NaN
import numpy as np
print(np.nan==np.nan)
print(np.isnan(np.nan)) # you need specific functions to verify nan.

False
True

In [6]:
students = [("Alice", "Brown"),("Jack", "White"),("Molly","Green")]
print(pd.Series(students))
print("\n")
# you can also pass index and list separately
s= pd.Series(['Physics','Chemistry', 'English'], index = ["Alice", "Molly","Jack"])
print(s)

0    (Alice, Brown)
1     (Jack, White)
2    (Molly, Green)
dtype: object


Alice      Physics
Molly    Chemistry
Jack       English
dtype: object

In [7]:
# If you create index that are not aligned with the values, the pandas create None or Nan values, or ignore
student_scores = {"Alice": 9, "Bob":2, "Mat": 6}
print(pd.Series(student_scores))
print("\n")
print(pd.Series(student_scores, index =["Alice",'Mat', 'Carlos'])) #Carlos was not on the list, however is explicity on the pandas list wiht NaN value.

Alice    9
Bob      2
Mat      6
dtype: int64


Alice     9.0
Mat       6.0
Carlos    NaN
dtype: float64

In [8]:
# if we want to query using the number location, use .iloc, if we want index name, use loc
s= pd.Series(student_scores)
print(s.iloc[0])
print(s['Alice'])
print(s[0])

#if index are numbers, so pandas cannot now in s[x] now if x is a number or index

class_code = {99: 'Physics',
              100: 'Chemistry',
              101: 'English',
              102: 'History'}

s= pd.Series(class_code)
# s[0] #it gives a error

9
9
9

In [9]:
# so we should use 
s.iloc[0]

'Physics'

# Vectorization

In [10]:
# pandas and numpy works together
import numpy as np
numbers = pd.Series(np.random.randint(0,1000,10000))

In [11]:
# Here, we're actually going to use what's called a cellular magic function. These start with two 
# percentage signs and wrap the code in the current Jupyter cell. The function we're going to use 
# is called timeit. This function will run our code a few times to determine, on average, how long 
# it takes.

# Let's run timeit with our original iterative code. You can give timeit the number of loops that 
# you would like to run. By default, it is 1,000 loops. I'll ask timeit here to use 100 runs because 
# we're recording this. Note that in order to use a cellular magic function, it has to be the first 
# line in the cell

In [12]:
%%timeit -n 100
total =0
for number in numbers:
    total+=number
total/len(numbers)

1.07 ms ± 66.8 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [13]:
%%timeit -n 100
total = np.sum(numbers)
total/len(numbers)

53.8 µs ± 4.11 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [14]:
# See the difference between both codes, the vectorization takes way less time

# Another feature we can do is broadcasting

In [15]:
numbers.head()

0    691
1    627
2    662
3    102
4    842
dtype: int64

In [16]:
numbers +=2
numbers.head()

0    693
1    629
2    664
3    104
4    844
dtype: int64

In [17]:
%%timeit -n 10
# pandas also allow the change of values in iterating method
s= pd.Series(np.random.randint(0,1000,1000))
for label, value in s.iteritems():
    s.iat[label]= value+2

25.2 ms ± 400 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [18]:
%%timeit -n 10
# let's try broadcasting
s= pd.Series(np.random.randint(0,1000,1000))
s+=2

#this procedure is way faster

148 µs ± 43.9 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

# Adding values

In [19]:
s= pd.Series([1,2,3])
s.loc['History'] = 100
s

0            1
1            2
2            3
History    100
dtype: int64

In [20]:
# Up until now I've shown only examples of a series where the index values were unique. I want 
# to end this lecture by showing an example where index values are not unique, and this makes 
# pandas Series a little different conceptually then, for instance, a relational database.

# Lets create a Series with students and the courses which they have taken
students_classes = pd.Series({'Alice': 'Physics',
                   'Jack': 'Chemistry',
                   'Molly': 'English',
                   'Sam': 'History'})
students_classes

Alice      Physics
Jack     Chemistry
Molly      English
Sam        History
dtype: object

In [21]:
# Now lets create a Series just for some new student Kelly, which lists all of the courses
# she has taken. We'll set the index to Kelly, and the data to be the names of courses.
kelly_classes = pd.Series(['Philosophy', 'Arts', 'Math'], index=['Kelly', 'Kelly', 'Kelly'])
kelly_classes

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [22]:
# We can append the kelly clases into the student classes using the function append
all_student_classes = students_classes.append(kelly_classes)
all_student_classes

Alice       Physics
Jack      Chemistry
Molly       English
Sam         History
Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

In [23]:
all_student_classes.loc['Kelly'] #it gets all the values assigned to Kelly

Kelly    Philosophy
Kelly          Arts
Kelly          Math
dtype: object

# Pandas Dataframe

In [24]:
# I'm going to jump in with an example. Lets create three school records for students and their 
# class grades. I'll create each as a series which has a student name, the class name, and the score. 
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [25]:
df= pd.DataFrame([record1,record2,record3])
df.head()

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [88]:
# Another way is to pass a list of dictionaires

student= [{'Name':'Carlos','Class':'Physics','Score':5},{'Name':'Bob','Class':'Chemistry','Score':8},{'Name':'Roberto','Class':'Biology','Score':7}]
df= pd.DataFrame(student, index =['school1','school2','school2'])
df

            Name      Class  Score
school1   Carlos    Physics      5
school2      Bob  Chemistry      8
school2  Roberto    Biology      7

In [27]:
# same as series, we can use loc and iloc
df.loc['school1']

Name      Carlos
Class    Physics
Score          5
Name: school1, dtype: object

In [28]:
# if we are only interested in Name
df.loc['school1','Name']

'Carlos'

In [29]:
# if we want only the names we can use
df.T.loc['Name']

school1     Carlos
school2        Bob
school2    Roberto
Name: Name, dtype: object

In [30]:
# another way is to use the index directly, since pandas consider as a column
df['Name']

# however df.loc['Name'] doesn't work

school1     Carlos
school2        Bob
school2    Roberto
Name: Name, dtype: object

In [31]:
# Here's another approach. As we saw, .loc does row selection, and it can take two parameters, 
# the row index and the list of column names. The .loc attribute also supports slicing.

# If we wanted to select all rows, we can use a colon to indicate a full slice from beginning to end. 
# This is just like slicing characters in a list in python. Then we can add the column name as the 
# second parameter as a string. If we wanted to include multiple columns, we could do so in a list. 
# and Pandas will bring back only the columns we have asked for.

# Here's an example, where we ask for all the names and scores for all schools using the .loc operator.
df.loc[:,['Name','Score']]

            Name  Score
school1   Carlos      5
school2      Bob      8
school2  Roberto      7

In [32]:
# Before we leave the discussion of accessing data in DataFrames, lets talk about dropping data.
# It's easy to delete data in Series and DataFrames, and we can use the drop function to do so. 
# This function takes a single parameter, which is the index or row label, to drop. This is another 
# tricky place for new users -- the drop function doesn't change the DataFrame by default! Instead,
# the drop function returns to you a copy of the DataFrame with the given rows removed.

df.drop('school1')

            Name      Class  Score
school2      Bob  Chemistry      8
school2  Roberto    Biology      7

In [33]:
df # the DataFrame is intact

            Name      Class  Score
school1   Carlos    Physics      5
school2      Bob  Chemistry      8
school2  Roberto    Biology      7

In [34]:
# you can make the function update the original data, just like pointers
copy_df =df.copy() #IMPORTANT, JUST LIKE NUMPY, IF YOU SET copy_df= df, the df will change as well
copy_df.drop('Name',inplace=True,axis=1)
copy_df

             Class  Score
school1    Physics      5
school2  Chemistry      8
school2    Biology      7

In [35]:
# We can also drop column using the function del,however this do not return a view
del copy_df['Class']
copy_df

         Score
school1      5
school2      8
school2      7

In [36]:
#Assign values
copy_df['Ranking'] = None
copy_df

         Score Ranking
school1      5    None
school2      8    None
school2      7    None

# Dataframe Indexing

In [37]:
df= pd.read_csv ('datasets/Admission_Predict.csv')
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [38]:
# We can set a column as index
df= pd.read_csv ('datasets/Admission_Predict.csv', index_col=0)
# We can also rename the names by providing an dictionary
df.columns

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR ', 'CGPA',
       'Research', 'Chance of Admit '],
      dtype='object')

In [39]:
# one way to solve is manualy rename
new_df= df.copy()
new_df=new_df.rename(columns={'GRE Score':'GRE Score', 'TOEFL Score':'TOEFL SCORE', 'University Rating':'University Rating', 'SOP': 'Statement of Purpose', 'LOR ':'Letter of Recommendation', 'CGPA':'CGPA',
       'Research':'Research', 'Chance of Admit ': 'Chance of Admit'})

In [40]:
# we may face space, tabs or other features in names, so we can use the function strip to remove those features
clean_df=df.copy()
clean_df = clean_df.rename(mapper= str.strip, axis ='columns')
clean_df.columns #You can see that the spaces were removed

Index(['GRE Score', 'TOEFL Score', 'University Rating', 'SOP', 'LOR', 'CGPA',
       'Research', 'Chance of Admit'],
      dtype='object')

In [41]:
cols = df.columns
cols= [x.lower().strip() for x in cols] # the function lower() makes everything in lowercase
df.columns= cols
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

# Querying Dataframe

In [81]:
df = pd.read_csv('datasets/Admission_Predict.csv', index_col=0)
df.columns = [x.lower().strip() for x in df.columns]
df.head()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [82]:
# now, lets apply a boolean factor
admit_mask = df['chance of admit'] >0.7
admit_mask

Serial No.
1       True
2       True
3       True
4       True
5      False
       ...
396     True
397     True
398     True
399    False
400     True
Name: chance of admit, Length: 400, dtype: bool

In [83]:
# once you are formed the mask, we can use .where function
df.where(admit_mask)

# the Dataframe keeps the index with NaN, we can use the function DROPNA()

,gre score,toefl score,university rating,sop,lor,cgpa,research,chance of admit
Serial No.,,,,,,,,
1,337.0,118.0,4.0,4.5,4.5,9.65,1.0,0.92
2,324.0,107.0,4.0,4.0,4.5,8.87,1.0,0.76
3,316.0,104.0,3.0,3.0,3.5,8.00,1.0,0.72
4,322.0,110.0,3.0,3.5,2.5,8.67,1.0,0.80
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
396,324.0,110.0,3.0,3.5,3.5,9.04,1.0,0.82
397,325.0,107.0,3.0,3.0,3.5,9.11,1.0,0.84
398,330.0,116.0,4.0,5.0,4.5,9.45,1.0,0.91
399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
400,333.0,117.0,4.0,5.0,4.0,9.66,1.0,0.95

In [ ]:
df.where(admit_mask).dropna()

In [ ]:
# another way to filter is 
df[df['chance of admit']>0.7].head() #this combines the dropna and where

In [ ]:
df[df['gre score']>320].head()

In [ ]:
# we can use multiple criteria, however we may need to use | and & operators

(df['chance of admit']>0.5) & (df['gre score']>300)
# we also heave functions greater than and lower than gt, lt
df['gre score'].gt(100).lt(300)

In [ ]:
# when indexing, after we set the index, if we want to get this data back to the dataframe, we need to create a new column
df= pd.read_csv('datasets/Admission_Predict.csv', index_col= 0)
df.columns = [x.strip() for x in df.columns] #remove the spaces or tab in the names
df['Serial Number'] = df.index
# Now we can set a new index
df.set_index('Chance of Admit')

In [ ]:
# we can reset the index
df.reset_index()

# Multiple indexing

In [ ]:
df = pd.read_csv('datasets/census.csv')
df['SUMLEV'].unique() # unique shows all the values that are different, in this case we have only 2 cases

In [ ]:
# let's filter one case
df=df[df['SUMLEV']==50]
df.head()

In [ ]:
# Also while this data set is interesting for a number of different reasons,
# let's reduce the data that we're going to look at to just the total population 
# estimates and the total number of births. We can do this by creating 
# a list of column names that we want to keep then project those and 
# assign the resulting DataFrame to our df variable.

columns_to_keep = ['STNAME','CTYNAME','BIRTHS2010','BIRTHS2011','BIRTHS2012','BIRTHS2013',
                   'BIRTHS2014','BIRTHS2015','POPESTIMATE2010','POPESTIMATE2011',
                   'POPESTIMATE2012','POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015']
df = df[columns_to_keep]
df

In [ ]:
df=df.set_index(['STNAME','CTYNAME'])

In [ ]:
# Then if we want to select an specific data, we need to select STNAME then CTYNAME
df.loc['Alabama','Walker County']

In [ ]:
df.loc[ [('Michigan', 'Washtenaw County'),
         ('Michigan', 'Wayne County')] ]
# this works, but is worth to work in a column way

# Missing Values

In [ ]:
# Missing Values are pretty common is very common in data science
# There are some ways to deal with that

In [ ]:
# Let's try it:
df= pd.read_csv('datasets/class_grades.csv')
df.columns = [x.strip() for x in df.columns]
df.head()

In [ ]:
# we can use the function isnull to verify in the whole dataset if you have missing data
mask= df.isnull()
mask.head()

In [ ]:
# we can drop the null functions using dropna()
df.dropna().head(10)

In [ ]:
# Another thing we can do is fill the nan with a value, for example 0
df.fillna(0,inplace= True)
df.head(10) # the index number 3 is filled with 0

# Missing Values Part 2

In [ ]:
df = pd.read_csv('datasets/log.csv')

In [ ]:
# lets sort this data using timestamp as index
df_sorted = df.copy()
df_sorted=df_sorted.set_index('time')
df_sorted= df_sorted.sort_index()
df_sorted.head()

In [ ]:
# is it common in that data to have index with the same value, so let's generate a multiple indexing system?
df_sorted=df_sorted.reset_index()
df_sorted=df_sorted.set_index(['time', 'user'])
df_sorted.head()

In [ ]:
# Now that the data is sorted with can use fillna with ffill (ffill is foward fill, using the data from the previous row, bfill uses backward
df_sorted= df.fillna(method ='ffill')
df_sorted.head()

In [ ]:
# we can also replace the data
series={'A':[1,1,2,3,4],'B':[3,4,5,6,7],'C':['a','b','c','d', 'e']}
df= pd.DataFrame(series)

In [ ]:
df.replace(1,100) #if we want to replace only one value

In [ ]:
# if we want to chamge multiple values, then:
df.replace([1,2],[100,200])

In [ ]:
#PANDAS allows regex too
df = pd.read_csv('datasets/log.csv')
df=df.replace('.*.html', value = 'webpage', regex= True)
df.head()

# Manipulating DataFrame

In [ ]:
# loading the csv
df = pd.read_csv('datasets/presidents.csv')
df.head()

In [ ]:
# cleaning the name and creating Firstname and Lastname
df['First'] = df['President']
df['First']=df['First'].replace('[ ].*', '', regex= True) #this works but is not very handy, cause you need to remove later the president collumn and add the lastname
# we can use the function apply

In [ ]:


df = pd.read_csv('datasets/presidents.csv')

def splitname(row):
    row['First'] = row['President'].split(' ')[0]
    row['Last'] = row['President'].split(' ')[-1]
    del row['President']
    return row

df= df.apply(splitname, axis = 'columns')
df.head()

In [ ]:
# Extract takes a regular expression as input and specifically requires you to set capture groups that
# correspond to the output columns you are interested in. And, this is a great place for you to pause the
# video and reflect - if you were going to write a regular expression that returned groups and just had the
# firstname and lastname in it, what would that look like?
df = pd.read_csv('datasets/presidents.csv')
pattern = '(?P<Firstname>^[\w]*)(?:.* )(?P<Lastname>[\w]*$)' # ANY character at the beggining, followed by any character followed by a space (exclude this from the pattern) and anchor any character at the end


df['President'].str.extract(pattern).head(4) #here we create a dataframe, so we can copy this on the original dataset

In [ ]:
names = df['President'].str.extract(pattern)
df['Firstname'] = names['Firstname']
df['Lastname']= names['Lastname']
df.head(4)

In [ ]:
pattern ='(\w{3} \w{1,2}, \w{4})'
df['Born']=df['Born'].str.extract(pattern)
df['Born'].head()

In [ ]:
# So, that cleans up the date format. But I'm going to foreshadow something else here - the type of this
# column is object, and we know that's what pandas uses when it is dealing with string. But pandas actually
# has really interesting date/time features - in fact, that's one of the reasons Wes McKinney put his efforts
# into the library, to deal with financial transactions. So if I were building this out, I would actually
# update this column to the write data type as well
df["Born"]=pd.to_datetime(df["Born"])
df["Born"].head()

In [60]:
# task: Lets repeat the same cleaning process for Age atstart of presidency and Died, using apply and str.extract
df = pd.read_csv('datasets/presidents.csv')

pattern = '(?P<PresidencyLenght>\w{1,2}\xa0\w{5}, \w{1,3}\xa0\w{4})(?P<PresidencyStart>.*)'
df['Age atstart of presidency'].str.extract(pattern)

df['PresidencyStart'] =df['Age atstart of presidency'].str.extract(pattern)['PresidencyStart']
df['PresidencyLenght']=df['Age atstart of presidency'].str.extract(pattern)['PresidencyLenght']

df['PresidencyStart'] = pd.to_datetime(df['PresidencyStart'])

df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age,PresidencyStart,PresidencyLenght
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days",1789-04-30,"57 years, 67 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days",1797-03-04,"61 years, 125 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days",1801-03-04,"57 years, 325 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days",1809-03-04,"57 years, 353 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days",1817-03-04,"58 years, 310 days"

In [93]:
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)
S.iloc[0:2]

1    Alice
2      Bob
dtype: object